budparr.language-hugo-vscode
eamodio.gitlens
esbenp.prettier-vscode
github.copilot
github.copilot-chat
golang.go
mikestead.dotenv
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-vscode.makefile-tools
ms-vsliveshare.vsliveshare
pkief.material-icon-theme
redhat.java
ritwickdey.liveserver
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
zhuangtongfa.material-theme
